{
  "backend/main.mo": "Main ICP actor for the VIPbansal sports platform, managing user profiles, game listings (with categories including Racing, Badminton, Shooting), player scores, and withdraw requests with admin/user role-based access control.",
  "backend/migration.mo": "Migration module that upgrades actor state from the old sport category schema (Cricket, Football, Basketball, Tennis) to the new schema adding Racing, Badminton, and Shooting, converting games and player scores accordingly.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (new game category filters, homepage R2S section, Terms & Conditions page) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key changes, serving as a reference for the frontend codebase structure and feature implementations.",
  "frontend/index.css": "Base Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, card, chart colors, sidebar, etc.) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'VIPbansal', mounting the app at the `#root` div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with all page routes (including `/terms` for TermsPage), a top loading progress bar, page transition wrapper, and a shared Navbar/Footer layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component displaying a pulsing shield icon, error message, and a 'Back to Home' button, shown when a non-admin user attempts to access a restricted page.",
  "frontend/src/components/CricketScoreWidget.tsx": "A React widget that displays a carousel of simulated cricket match scores (Live, Result, Upcoming) with animated status badges, team score displays, and auto-rotating match cards.",
  "frontend/src/components/Footer.tsx": "A site footer component with brand info, quick navigation links, sports category links, and legal links (Privacy Policy, Terms of Service), using TanStack Router for internal navigation.",
  "frontend/src/components/GameCard.tsx": "A card component that displays a game's thumbnail, category badge, sport emoji, and a play button that opens the game URL in a new tab, with fallback images per sport category.",
  "frontend/src/components/LeaderboardTable.tsx": "A table component that renders the top 10 player scores with rank badges (trophy/medal icons for top 3), player name, sport emoji, and score, highlighting top-3 rows in gold.",
  "frontend/src/components/Navbar.tsx": "A sticky navigation bar with desktop and mobile menus, links to Home/Games/Leaderboard/R2S Game/Mini Cricket, Internet Identity auth controls (login/logout), and a conditional admin link for admin users.",
  "frontend/src/components/ScoreSubmissionForm.tsx": "A React form component that allows players to submit their sport scores by entering a username, score, and sport category, with success/error feedback using the useAddPlayerScore mutation hook.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity state tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for interacting with the backend actor, covering games, scores, user profiles, admin checks, and withdrawal requests via queries and mutations.",
  "frontend/src/index.css": "Global CSS file that imports custom fonts, configures Tailwind with a dark sports theme using OKLCH color variables (gold and red accents), and defines utility classes for glows, gradients, and card hover effects.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "An admin-only page with tabbed sections for managing users, viewing top scores, and handling withdrawal requests, with inline editing and approval/deletion actions guarded by admin role checks.",
  "frontend/src/pages/GamesPage.tsx": "Displays a filterable grid of all available sports games, fetched via useGetAllGames, with category filter buttons and skeleton loading states.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section, feature highlights, sport categories, featured games carousel, and a top-player leaderboard snippet.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows the top-10 player leaderboard fetched via useGetTopScores alongside a score submission form, with refresh and error-handling UI.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page that triggers Internet Identity login via useInternetIdentity and redirects to home on successful authentication.",
  "frontend/src/pages/MiniCricketPage.tsx": "A self-contained mini cricket game where the player hits a ball for 6 balls, with randomized run/out outcomes, score tracking, and a play-again option.",
  "frontend/src/pages/OTPLoginPage.tsx": "A multi-step OTP login page that collects a phone number, generates a simulated 6-digit OTP, and verifies it client-side before showing a success state.",
  "frontend/src/pages/PasswordResetPage.tsx": "A static informational page explaining that the app uses Internet Identity instead of passwords, with step-by-step instructions for recovering account access.",
  "frontend/src/pages/R2SGamePage.tsx": "An interactive cricket mini-game page where users time button presses to hit balls, earn runs converted to coins, and can withdraw coins via a dialog using backend hooks.",
  "frontend/src/pages/SignUpPage.tsx": "A registration page that requires Internet Identity authentication first, then collects name, username, and email to register a new user via a backend mutation.",
  "frontend/src/pages/TermsPage.tsx": "A static Terms & Conditions page for the R2S Sports Champion Pro app, rendering multiple legal sections covering usage rules, accounts, coins, fair play, and IP.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Orbitron, Rajdhani, Inter), an extended color palette using OKLCH variables (brand, gold, sidebar, chart colors), border radii, and box shadows.",
  "project_state.json": "Project state snapshot (version 29) describing the VIPbansal/R2S Sports Champion Pro platform, including architectural notes, data models, sport categories, known issues, image requirements, and a list of existing implemented features."
}