{
  "backend/main.mo": "Main actor for the VIPbansal sports gaming platform, defining Game, PlayerScore, and UserProfile types with CRUD operations, access-controlled endpoints for user registration/profile management, game management, score submission, and leaderboard queries.",
  "backend/migration.mo": "Data migration module that upgrades the actor state by adding a `gameUrl` field (defaulting to empty string) to all existing Game records.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their titles, associated source files, component dependencies, and test IDs for the VIPbansal platform.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference index for the project's frontend components and pages.",
  "frontend/index.css": "Base Tailwind CSS entry file defining CSS custom property tokens for light and dark themes (colors, borders, chart colors, sidebar) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell with a root div and a module script entry point for the VIPbansal React app.",
  "frontend/src/App.tsx": "Root React app file that sets up TanStack Router with all page routes, a top loading progress bar, and a page transition wrapper inside a shared Navbar/Footer layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component displaying a red shield icon with a ping animation, descriptive messaging, and a back-to-home button for unauthorized admin page access.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, quick navigation links, sports category links, and a copyright bar.",
  "frontend/src/components/GameCard.tsx": "Displays a single game as a card with thumbnail, category badge, sport emoji, and a play button that opens the game URL in a new tab.",
  "frontend/src/components/LeaderboardTable.tsx": "Renders a ranked leaderboard table showing player scores with special rank badges (trophy/medal) for the top 3 positions.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with logo, desktop/mobile nav links, authentication state handling (login/logout), and conditional admin link visibility.",
  "frontend/src/components/ScoreSubmissionForm.tsx": "Form component for submitting a player score with username, score value, and sport category fields, including success and error feedback states.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using the user's Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including games, scores, user profiles, and admin operations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Google Fonts, and defines a dark sports-themed design system with gold/red color variables and utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed views for managing users and scores, supporting inline editing, deletion, and data reset with confirmation dialogs.",
  "frontend/src/pages/GamesPage.tsx": "Games library page that displays all games in a filterable grid by sport category, with loading skeletons and error handling.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying a hero banner, feature highlights, sports categories, featured games carousel, and a top-player leaderboard snippet using data from React Query hooks.",
  "frontend/src/pages/LeaderboardPage.tsx": "Leaderboard page that fetches and displays the top 10 player scores in a table alongside a score submission form, with loading/error states and a refresh button.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity, redirects already-authenticated users to home, and provides a link to the sign-up page.",
  "frontend/src/pages/PasswordResetPage.tsx": "Informational page explaining that the app uses Internet Identity instead of passwords, with step-by-step instructions for managing device access and recovery.",
  "frontend/src/pages/SignUpPage.tsx": "Registration page that connects an Internet Identity, collects a username and email, validates the form, and calls the registerUser mutation to create a new account.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Orbitron, Rajdhani, Inter), an extended color palette using OKLCH variables (including brand red/gold/dark), border radii, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for the VIPbansal Android sports gaming website, documenting existing features (homepage, game listings, leaderboard, navbar, sign-up), required images, architectural notes, and versioning."
}