{
  "kind": "build_request",
  "title": "Add Terms & Conditions page, update Homepage hero with R2S app description, and add new sport categories (Racing, Badminton, Shooting)",
  "projectName": "R2S Sports Champion Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-39",
      "text": "Add Racing, Badminton, and Shooting as new sport categories to the backend game data. Pre-populate the backend with at least 2 game entries per new category (Racing, Badminton, Shooting), each with a name, sport category, short description, thumbnail image URL, and a working external game URL. Update any backend category validation or enums to include these three new categories.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "🏎️ Racing – Speed through challenging tracks & unlock cool vehicles.",
          "🏸 Badminton – Smash and serve like a pro.",
          "🎯 Shooting – Test your aim and reflexes."
        ]
      },
      "acceptanceCriteria": [
        "Backend stores game entries for Racing, Badminton, and Shooting categories",
        "At least 2 game entries exist per new category",
        "Each entry includes name, category, description, thumbnailUrl, and gameUrl fields",
        "getGames endpoint returns all new entries including the new categories"
      ]
    },
    {
      "id": "REQ-40",
      "text": "Update the Games page (/games) category filter bar to include filter buttons for Racing, Badminton, and Shooting alongside the existing All, Cricket, Football, Basketball, and Tennis filters. Game cards for these new categories must render correctly using the existing GameCard component.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "🏎️ Racing – Speed through challenging tracks & unlock cool vehicles.",
          "🏸 Badminton – Smash and serve like a pro.",
          "🎯 Shooting – Test your aim and reflexes."
        ]
      },
      "acceptanceCriteria": [
        "Filter bar shows buttons for Racing, Badminton, and Shooting",
        "Clicking a new category button filters game cards to that category only",
        "Active filter button is highlighted with existing gold/red brand colors",
        "Game cards for new categories display correctly with the GameCard component"
      ]
    },
    {
      "id": "REQ-41",
      "text": "Update the homepage hero/about section in frontend/src/pages/HomePage.tsx to include the R2S Sports Champion Pro app description. The section must highlight: six sports (Cricket, Football, Basketball, Racing, Badminton, Shooting) each with their emoji, smooth controls & realistic physics, offline & online play, unlock achievements and rewards, and compete with friends & global leaderboard. Use the existing dark red/gold VIPbansal theme and bold typography.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Step into the world of R2S Sports Champion Pro – the ultimate multi-sports gaming experience!",
          "Play your favorite sports anytime, anywhere",
          "Multiple sports in a single app",
          "Smooth controls & realistic physics",
          "Offline & online play",
          "Unlock achievements and rewards",
          "Compete with friends & global leaderboard"
        ]
      },
      "acceptanceCriteria": [
        "Homepage hero or about section displays the R2S Sports Champion Pro tagline",
        "All six sports are listed with their respective emojis (🏏 Cricket, ⚽ Football, 🏀 Basketball, 🏎️ Racing, 🏸 Badminton, 🎯 Shooting)",
        "Feature highlights are visible: smooth controls, offline & online play, achievements, global leaderboard",
        "Styling is consistent with the existing dark red/gold VIPbansal theme"
      ]
    },
    {
      "id": "REQ-42",
      "text": "Create a Terms & Conditions page at route /terms in the React frontend. The page must display T&C content relevant to R2S Sports Champion Pro, structured with sections covering: (1) Acceptance of Terms; (2) Use of the App (permitted and prohibited uses); (3) User Accounts and Registration; (4) In-App Coins and Rewards (virtual currency, no real monetary value unless stated); (5) Leaderboard and Fair Play; (6) Intellectual Property; (7) Disclaimer of Warranties; (8) Limitation of Liability; (9) Changes to Terms; (10) Contact Us (email: mjkjbansal@gmail.com); (11) 'Last Updated: 2026' footer note. Style the page consistently with the existing dark red/gold VIPbansal theme (dark background, gold/red section headings, bold typography, Tailwind utility classes).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Read our Terms & Conditions here: [Terms & Conditions](terms.htm)"
        ]
      },
      "acceptanceCriteria": [
        "Page is accessible at route /terms",
        "All 11 sections are present and readable",
        "Contact email mjkjbansal@gmail.com is displayed in the Contact Us section",
        "'Last Updated: 2026' appears as a footer note on the page",
        "Page styling matches the dark red/gold VIPbansal theme"
      ]
    },
    {
      "id": "REQ-43",
      "text": "Add a 'Terms & Conditions' link to the Footer component (frontend/src/components/Footer.tsx) that navigates to the /terms route, placed alongside the existing Privacy Policy link. Register the /terms route in the TanStack Router configuration in frontend/src/App.tsx.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Read our Terms & Conditions here: [Terms & Conditions](terms.htm)"
        ]
      },
      "acceptanceCriteria": [
        "Footer displays a 'Terms & Conditions' link next to the Privacy Policy link",
        "Clicking the link navigates to /terms",
        "/terms route is registered in the TanStack Router configuration in App.tsx",
        "The TermsPage component is rendered at /terms"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed in frontend.immutablePaths",
    "All Motoko logic must remain in the single backend/main.mo actor file",
    "Use only the existing dark red/gold VIPbansal theme and Tailwind utility classes for all new UI"
  ],
  "nonGoals": [
    "Real-time live sports data or external API integrations",
    "Actual SMS or email delivery for OTP or notifications",
    "Real monetary transactions or payment gateway integration",
    "Backend persistence for Terms & Conditions content"
  ],
  "imageRequirements": {
    "required": [
      "Racing sport category icon illustration with a red racing car on dark background (racing-category-icon.dim_256x256.png)",
      "Badminton sport category icon illustration with a shuttlecock and racket on dark background (badminton-category-icon.dim_256x256.png)",
      "Shooting sport category icon illustration with a target and crosshair on dark background (shooting-category-icon.dim_256x256.png)"
    ],
    "edits": []
  }
}