{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Activate Full Online Gaming Experience — Real Game URLs, Category Filters, Live Leaderboard & Polished UI",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Update GameCard component to open real game URLs in new tabs and ensure all games display working Play Now buttons",
      "acceptanceCriteria": [
        "Each game card displays a working 'Play Now' button",
        "Clicking 'Play Now' opens the game URL in a new browser tab",
        "Backend game entries include a gameUrl field populated with real, accessible online game URLs",
        "At least 2 games per sport category (Cricket, Football, Basketball, Tennis) are seeded in the backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GameCard.tsx",
          "operation": "modify",
          "description": "Update the play button to use the game.gameUrl field from the backend. Add target='_blank' and rel='noopener noreferrer' attributes to open the game URL in a new browser tab. Ensure the button is visually prominent and uses the existing sport-specific color scheme. Handle cases where gameUrl might be missing with appropriate fallback behavior."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add sport category filter bar to the Games page with reactive filtering and visual active state highlighting",
      "acceptanceCriteria": [
        "A row of filter buttons appears above the games grid: All, Cricket, Football, Basketball, Tennis",
        "Clicking a category filters the game cards to show only that sport",
        "Clicking 'All' shows all games",
        "The active filter button is visually distinguished with gold/red highlight",
        "Filter works reactively without a page reload"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamesPage.tsx",
          "operation": "modify",
          "description": "Add a filter bar component above the games grid displaying buttons for All, Cricket, Football, Basketball, and Tennis categories. Implement local state to track the active filter. Filter the games array based on the selected category before rendering the grid. Apply gold/red visual highlighting to the active filter button using the existing brand colors from the theme. Ensure the filter UI is responsive and matches the dark sports aesthetic."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Enhance Leaderboard page with auto-refresh after score submission, manual refresh button, and ensure form is prominently visible",
      "acceptanceCriteria": [
        "Score submission form is visible on the Leaderboard page",
        "Submitting a score updates the leaderboard table immediately after success",
        "A 'Refresh' button allows manual reload of the leaderboard data",
        "Top 10 players are shown with rank, username, sport category, and score",
        "Success and error messages are shown after form submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LeaderboardPage.tsx",
          "operation": "modify",
          "description": "Add a manual 'Refresh' button above or next to the leaderboard table that triggers a refetch of the leaderboard data. Ensure the ScoreSubmissionForm triggers an immediate leaderboard refresh after successful submission by invalidating the scores query. Verify the form is prominently positioned and styled to stand out. Enhance success/error feedback messaging to be more visible and user-friendly."
        },
        {
          "path": "frontend/src/components/ScoreSubmissionForm.tsx",
          "operation": "modify",
          "description": "Update the form to invalidate the leaderboard query immediately after a successful score submission, ensuring the leaderboard auto-refreshes. Enhance the success and error message display to be more prominent with appropriate styling using the brand colors. Ensure the form remains functional for both authenticated and guest users."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Polish overall UI with animated hover effects, Featured Games section, Top Player ticker, page transitions, and loading progress bar",
      "acceptanceCriteria": [
        "Game cards animate on hover (scale + glow effect)",
        "Home page has a 'Featured Games' horizontal scroll section with real game data",
        "Home page shows a 'Top Player' banner or ticker with the current #1 leaderboard entry",
        "Route transitions have a smooth fade or slide animation",
        "A thin top progress bar appears during data loading states"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GameCard.tsx",
          "operation": "modify",
          "description": "Add CSS transitions and hover effects to the game card: scale transform on hover (e.g., scale-105) and a glowing gold/red border effect. Use Tailwind utilities for smooth transitions and the brand colors defined in tailwind.config.js. Ensure the animation is performant and enhances the gaming platform feel."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a 'Featured Games' horizontal scroll section below the hero banner. Fetch a subset of games from the backend (4–6 games) and display them in a horizontally scrollable container using GameCard components. Add a 'Top Player' badge or ticker section that fetches and displays the current #1 player from the leaderboard with their username, sport, and score. Style both sections with the dark gaming aesthetic and gold accents. Reference the generated featured-games-banner image at frontend/public/assets/generated/featured-games-banner.dim_1200x300.png as a background or decorative element in the Featured Games section."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add smooth page transition animations between routes using CSS transitions or a React animation library. Implement a thin top loading progress bar that appears during route changes and data fetching states. Use a library like nprogress or a custom component with the brand gold/red colors. Ensure transitions are subtle and enhance the professional feel without being distracting."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS rules for page transition animations and the top loading progress bar styling. Define keyframes and transition utilities that can be reused across components. Use the existing OKLCH custom properties for gold/red colors to ensure brand consistency. Add any necessary utility classes for the new UI enhancements."
        }
      ]
    }
  ]
}