{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Terms & Conditions page, update Homepage hero with R2S app description, and add new sport categories (Racing, Badminton, Shooting)",
  "requirements": [
    {
      "id": "REQ-40",
      "summary": "Update the Games page (/games) category filter bar to include filter buttons for Racing, Badminton, and Shooting alongside the existing All, Cricket, Football, Basketball, and Tennis filters. Game cards for these new categories must render correctly using the existing GameCard component.",
      "acceptanceCriteria": [
        "Filter bar shows buttons for Racing, Badminton, and Shooting",
        "Clicking a new category button filters game cards to that category only",
        "Active filter button is highlighted with existing gold/red brand colors",
        "Game cards for new categories display correctly with the GameCard component"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamesPage.tsx",
          "operation": "modify",
          "description": "Add Racing, Badminton, and Shooting filter buttons to the category filter bar alongside existing categories (All, Cricket, Football, Basketball, Tennis). Update the filtering logic to handle the new categories. Ensure the active filter button styling uses the existing gold/red brand colors defined in the VIPbansal theme. The GameCard component already handles category display via emoji, so no changes are needed there—game cards for Racing, Badminton, and Shooting will render correctly once the backend provides them."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Update the homepage hero/about section in frontend/src/pages/HomePage.tsx to include the R2S Sports Champion Pro app description. The section must highlight: six sports (Cricket, Football, Basketball, Racing, Badminton, Shooting) each with their emoji, smooth controls & realistic physics, offline & online play, unlock achievements and rewards, and compete with friends & global leaderboard. Use the existing dark red/gold VIPbansal theme and bold typography.",
      "acceptanceCriteria": [
        "Homepage hero or about section displays the R2S Sports Champion Pro tagline",
        "All six sports are listed with their respective emojis (🏏 Cricket, ⚽ Football, 🏀 Basketball, 🏎️ Racing, 🏸 Badminton, 🎯 Shooting)",
        "Feature highlights are visible: smooth controls, offline & online play, achievements, global leaderboard",
        "Styling is consistent with the existing dark red/gold VIPbansal theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the hero or about section to display the R2S Sports Champion Pro tagline: 'Step into the world of R2S Sports Champion Pro – the ultimate multi-sports gaming experience!' Add a section listing all six sports with their emojis: 🏏 Cricket, ⚽ Football, 🏀 Basketball, 🏎️ Racing, 🏸 Badminton, 🎯 Shooting. Include feature highlights: 'Multiple sports in a single app', 'Smooth controls & realistic physics', 'Offline & online play', 'Unlock achievements and rewards', 'Compete with friends & global leaderboard'. Use the existing dark red/gold VIPbansal theme from Tailwind config (text-gold, text-brand-red, bg-dark) and bold typography (font-heading, font-bold). Structure the section with clear visual hierarchy using Tailwind utility classes consistent with the existing HomePage design."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Create a Terms & Conditions page at route /terms in the React frontend. The page must display T&C content relevant to R2S Sports Champion Pro, structured with sections covering: (1) Acceptance of Terms; (2) Use of the App (permitted and prohibited uses); (3) User Accounts and Registration; (4) In-App Coins and Rewards (virtual currency, no real monetary value unless stated); (5) Leaderboard and Fair Play; (6) Intellectual Property; (7) Disclaimer of Warranties; (8) Limitation of Liability; (9) Changes to Terms; (10) Contact Us (email: mjkjbansal@gmail.com); (11) 'Last Updated: 2026' footer note. Style the page consistently with the existing dark red/gold VIPbansal theme (dark background, gold/red section headings, bold typography, Tailwind utility classes).",
      "acceptanceCriteria": [
        "Page is accessible at route /terms",
        "All 11 sections are present and readable",
        "Contact email mjkjbansal@gmail.com is displayed in the Contact Us section",
        "'Last Updated: 2026' appears as a footer note on the page",
        "Page styling matches the dark red/gold VIPbansal theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TermsPage.tsx",
          "operation": "create",
          "description": "Create a new TermsPage component that renders the Terms & Conditions content for R2S Sports Champion Pro. Structure the page with 11 sections: (1) Acceptance of Terms, (2) Use of the App (permitted and prohibited uses), (3) User Accounts and Registration, (4) In-App Coins and Rewards (virtual currency, no real monetary value unless stated), (5) Leaderboard and Fair Play, (6) Intellectual Property, (7) Disclaimer of Warranties, (8) Limitation of Liability, (9) Changes to Terms, (10) Contact Us (email: mjkjbansal@gmail.com), (11) 'Last Updated: 2026' footer note. Use the existing dark red/gold VIPbansal theme: dark background (bg-dark-bg or bg-black), gold/red section headings (text-gold, text-brand-red), bold typography (font-heading), and Tailwind utility classes for spacing and layout. Wrap content in a max-width container with padding for readability. Use semantic HTML (h1 for page title, h2 for section headings, p for paragraphs). Ensure the page is scrollable and visually consistent with other pages in the app."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Add a 'Terms & Conditions' link to the Footer component (frontend/src/components/Footer.tsx) that navigates to the /terms route, placed alongside the existing Privacy Policy link. Register the /terms route in the TanStack Router configuration in frontend/src/App.tsx.",
      "acceptanceCriteria": [
        "Footer displays a 'Terms & Conditions' link next to the Privacy Policy link",
        "Clicking the link navigates to /terms",
        "/terms route is registered in the TanStack Router configuration in App.tsx",
        "The TermsPage component is rendered at /terms"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add a 'Terms & Conditions' link to the Footer component, placed alongside the existing Privacy Policy link in the quick links or legal section. The link should navigate to the /terms route using TanStack Router's Link component. Style the link consistently with the existing Footer links (hover effects, text color, spacing)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the /terms route in the TanStack Router configuration alongside existing routes (e.g., /mini-cricket, /r2s-game). Import the TermsPage component and add a new route object that renders TermsPage at path '/terms'. Ensure the route is wrapped in the shared Layout with Navbar and Footer. Follow the existing route registration pattern in the router configuration."
        }
      ]
    }
  ]
}